---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.EnergyAnalysisPercentageGlazing
source: html/c55c83ad-86b6-c1d3-715c-17a8ac400d59.htm
---
# Autodesk.Revit.DB.ParameterTypeId.EnergyAnalysisPercentageGlazing Property

"Target Percentage Glazing"

## Syntax (C#)
```csharp
public static ForgeTypeId EnergyAnalysisPercentageGlazing { get; }
```